INSERT INTO project (name, user_id) 
VALUES 
("Входящие", 2), ("Авто", NULL), ("Домашние дела", 2), ("Работа", 1), ("Учеба", 1);

INSERT INTO users (date_reg, name, email, pass)
VALUES 
("2019-01-02", "Константин", "costya@mail.ru", "costya26"),
("2019-06-02", "Пётр", "petya@mail.ru", "petya36");

INSERT INTO tasks (date_create, date_exec, status, name, file, deadline, project_id, user_id) 
VALUES
("2019-06-02", "2019-12-01", "0", "Собеседование в IT компании", "tasks/1.txt", "2019-11-21 09:00:00", 4, 1),
("2019-06-02", "2019-12-25", "0", "Выполнить тестовое задание", "tasks/2.txt", "2019-12-23 09:00:00", 4, 1),
("2019-06-02", "2019-12-21", "1", "Сделать задание первого раздела", "tasks/3.txt", "2019-12-19 09:00:00", 5, 1),
("2019-06-02", "2019-12-22", "0", "Встреча с другом", "tasks/4.txt", "2019-12-22 09:00:00", 1, 2),
("2019-06-02", "2019-12-22", "0", "Купить корм для кота", "tasks/5.txt", "2019-12-22 09:00:00", 3, 2),
("2019-06-02", "2019-12-22", "0", "Заказать пиццу", "tasks/6.txt", "2019-12-22 09:00:00", 3, 2);

--Получаем список из всех проектов для одного пользователя;
SELECT name FROM project
WHERE user_id = "1";

--Получаем список из всех задач для одного проекта;
SELECT name FROM tasks
WHERE project_id = "1";

--Помечаем задачу как выполненную;
UPDATE tasks SET status = "1"
WHERE name = "Собеседование в IT компании";

--Обновляем название задачи по её идентификатору
UPDATE tasks SET name = "Собеседование в компании IT"
WHERE id = 1;